import BlogDetail from "@/components/BlogDetail";
import React from "react";
import whatisTailwindcss from "@/public/assets/whatisTailwindcss.png";
import secondImageWhatIsTailwind from "@/public/assets/Blog/secondImageWhatIsTailwind.png";

function page() {
  return (
    <>
      <BlogDetail
        firstImageAlt={"معرفی فریمورک Tailwind CSS"}
        firstImageSrc={whatisTailwindcss}
        secondImage={secondImageWhatIsTailwind}
        thirdImage={whatisTailwindcss}
        title={"معرفی فریمورک Tailwind CSS"}
        firstBody={
          "CSS که یکی از مهمترین تکنولوژی ها در بحث طراحی و توسعه وب سایت ها است و به منظور استایل دهی و زیبا سازی صفحات وب سایت ها استفاده میشود. همچنین با استفاده از آن میتوانید صفحات وب را به طور دلخواه، شخصی سازی و طراحی کنید.  زمانی این استایل دهی ها با CSS به صورت خام دشوار می‌شود که شما می‌بایست وب سایت ها و اپلیکیشن های بزرگی با تعداد صفحات زیاد طراحی کنید. معمولا توسعه دهندگان برای رفع چنین مشکلاتی از فریمورک های CSS که شامل قواعد از پیش تعیین شده، کدهای استاندارد و بهینه ، کلاس ها و ‌غیره هستند را استفاده می کنند."
        }
        secondTitle={""}
        secondBody={
          ""
        }
        thirdTitle={""}
        thirdBody={
          ""
        }
        forthTitle={
          "آشنایی بیشتر با Tailwind"
        }
        fifthTitle={""}
        forthBody={
          "Tailwind CSS فریمورک جدید CSS است که در مقایسه با سایر فریمورک های CSS تفاوت های کلیدی دارد.   اما آنچه که درباره این فریمورک بسیار مورد توجه قرار میگیرد، این است که فریمورک Tailwind برخلاف سایر فریمورک ها، فاقد هر نوع قالب پیش فرض بوده و هیچگونه کامپوننت داخلی به‌ منظور رابط کاربری در آن وجود ندارد.   "
        }
        sixthTitle={"Utility-first .1 "}
        fifthBody={
          " این رویکرد بر ارائه طیف گسترده ای از کلاس های کاربردی متمرکز است که می توان آن ها را برای طرح های سفارشی ترکیب کرد. این رویکرد به توسعه‌دهندگان انعطاف‌پذیری و کنترل بیشتری بر استایل دهی به عناصر خود در مقایسه با استفاده از اجزای از پیش طراحی‌شده می‌دهد.  برای مثال کلاس px-1 در جهت محور x ها به اندازه 0.25rem، به ما padding میدهد."
        }
        seventhTitle={
          "2. بدون استایل های پیش فرض"
        }
        sixthBody={
          "اگر قبلا با فریم ورک ها کار کرده باشید، با سری سبک های پیش فرض انها آشنایی دارید و میدانید که برای اجزای مختلفی اعمال میشوند؛ اما Tailwind CSS برخلاف سایر فریم ورک ها، هیچ سبک پیش فرضی رو اعمال نمیکند.این کارکرد به توسعه دهندگان وب این امکان را میدهد که صفحه خالی خود را مطابق سلیقه و چیزی که مد نظر دارند، با استفاده از کلاس های کاربردی طراحی کنند."
        }
        eightthTitle={"3. اندازه فایل کوچکتر"}
        seventhBody={
          "از آنجایی که Tailwind CSS فقط شامل کلاسهای کاربردی است که حتما در پروژه مورد استفاده قرار میگیرد، معمولاً در مقایسه با فریم ورک هایی که تعداد زیادی مؤلفه از پیش طراحی شده دارند، اندازه فایل های آن کوچکتر می شود."
        }
        nineThTitle={""}
        eighthBody={
          "به طور کلی، فریمورک Tailwind CSS با تمرکز بر کلاس‌های کاربردی به جای مؤلفه‌های از پیش طراحی‌شده، رویکرد متفاوتی را برای طراحی برنامه‌های کاربردی تحت وب ارائه کرده است. این فریمورک قابلیت انعطاف پذیری و سفارشی سازی بیشتری را فراهم می کند، اما ممکن است برای یادگیری و استفاده از آن به تلاش بیشتری نیاز داشته باشید."
        }
        tenthTitle={""}
        ninethBody={
          ""
        }
        eleventhTitle={
          ""
        }
        tenthBody={""}
        date={"۱۴۰۲/۱۱/۲۶"}
        author={"عرفان رضایی"}
      />
    </>
  );
}

export default page;
